Ran Plan for project: `gmalkov` dir: `scp-deployment` workspace: `gmalkov`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.single-cell-portal.google_compute_network.vpc-network[0] will be created
+ resource "google_compute_network" "vpc-network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "singlecell"
      + project                         = "broad-singlecellportal-gmalkov"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.single-cell-portal.google_project_iam_member.app[0] will be created
+ resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-singlecellportal-gmalkov"
      + role    = "roles/compute.viewer"
    }

  # module.single-cell-portal.google_project_iam_member.app[1] will be created
+ resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-singlecellportal-gmalkov"
      + role    = "roles/logging.logWriter"
    }

  # module.single-cell-portal.google_project_iam_member.app[2] will be created
+ resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-singlecellportal-gmalkov"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.single-cell-portal.google_service_account.app[0] will be created
+ resource "google_service_account" "app" {
      + account_id   = "singlecell-gmalkov"
      + display_name = "singlecell-gmalkov"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "broad-singlecellportal-gmalkov"
      + unique_id    = (known after apply)
    }

  # module.single-cell-portal.random_id.mongodb-root-password will be created
+ resource "random_id" "mongodb-root-password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.single-cell-portal.random_id.mongodb-user-password will be created
+ resource "random_id" "mongodb-user-password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.single-cell-portal.vault_generic_secret.app-database-credentials will be created
+ resource "vault_generic_secret" "app-database-credentials" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/kdux/scp/gmalkov/mongo/user"
    }

  # module.single-cell-portal.vault_generic_secret.hostnames will be created
+ resource "vault_generic_secret" "hostnames" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/kdux/scp/gmalkov/mongo/hostname"
    }

  # module.single-cell-portal.vault_generic_secret.root-database-credentials will be created
+ resource "vault_generic_secret" "root-database-credentials" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/kdux/scp/gmalkov/mongo/root_user"
    }

  # module.single-cell-portal.module.enable-services.google_project_service.cloudresourcemanager[0] will be created
+ resource "google_project_service" "cloudresourcemanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "broad-singlecellportal-gmalkov"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.single-cell-portal.module.enable-services.google_project_service.required-services[0] will be created
+ resource "google_project_service" "required-services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "broad-singlecellportal-gmalkov"
      + service            = "serviceusage.googleapis.com"
    }

  # module.single-cell-portal.module.enable-services.google_project_service.required-services[1] will be created
+ resource "google_project_service" "required-services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "broad-singlecellportal-gmalkov"
      + service            = "iam.googleapis.com"
    }

  # module.single-cell-portal.module.enable-services.google_project_service.serviceusage[0] will be created
+ resource "google_project_service" "serviceusage" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "broad-singlecellportal-gmalkov"
      + service            = "serviceusage.googleapis.com"
    }

  # module.single-cell-portal.module.mongodb.google_storage_bucket.config-bucket will be created
+ resource "google_storage_bucket" "config-bucket" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + labels             = {
          + "app"   = "singlecell"
          + "owner" = "gmalkov"
          + "role"  = "config"
        }
      + location           = "US"
      + name               = "gmalkov-singlecell-config"
      + project            = "broad-singlecellportal-gmalkov"
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.single-cell-portal.module.mongodb.google_storage_bucket_iam_member.app_config[0] will be created
+ resource "google_storage_bucket_iam_member" "app_config" {
      + bucket = "gmalkov-singlecell-config"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.legacyBucketReader"
    }

  # module.single-cell-portal.module.mongodb.google_storage_bucket_iam_member.app_config[1] will be created
+ resource "google_storage_bucket_iam_member" "app_config" {
      + bucket = "gmalkov-singlecell-config"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.single-cell-portal.module.mongodb.google_storage_bucket_object.docker-compose[0] will be created
+ resource "google_storage_bucket_object" "docker-compose" {
      + bucket         = "gmalkov-singlecell-config"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "singlecell-01/configs/docker-compose.yaml"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.single-cell-portal.module.mongodb.module.instances.google_compute_address.instance-public-ip[0] will be created
+ resource "google_compute_address" "instance-public-ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "singlecell-01"
      + network_tier       = (known after apply)
      + project            = "broad-singlecellportal-gmalkov"
      + purpose            = (known after apply)
      + region             = "us-central1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.single-cell-portal.module.mongodb.module.instances.google_compute_disk.instance-data-disk[0] will be created
+ resource "google_compute_disk" "instance-data-disk" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "singlecell-01-data-disk"
      + physical_block_size_bytes = (known after apply)
      + project                   = "broad-singlecellportal-gmalkov"
      + self_link                 = (known after apply)
      + size                      = 200
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-ssd"
      + users                     = (known after apply)
      + zone                      = "us-central1-a"
    }

  # module.single-cell-portal.module.mongodb.module.instances.google_compute_disk.instance-docker-disk[0] will be created
+ resource "google_compute_disk" "instance-docker-disk" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "singlecell-01-docker-disk"
      + physical_block_size_bytes = (known after apply)
      + project                   = "broad-singlecellportal-gmalkov"
      + self_link                 = (known after apply)
      + size                      = 50
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-ssd"
      + users                     = (known after apply)
      + zone                      = "us-central1-a"
    }

  # module.single-cell-portal.module.mongodb.module.instances.google_compute_instance.instance[0] will be created
+ resource "google_compute_instance" "instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + labels                    = {
          + "ansible_branch"  = "master"
          + "ansible_project" = "singlecell"
          + "app"             = "singlecell-mongo"
          + "owner"           = "gmalkov"
          + "role"            = "db"
        }
      + machine_type              = "n1-highmem-2"
      + metadata_fingerprint      = (known after apply)
      + metadata_startup_script   = <<~EOT
            #!/bin/bash
            
            # Only run this script once
            if [ -f /etc/sysconfig/gce-metadata-run ];
                then
                exit 0
            fi
            
            #stop and disable firewalld
            systemctl stop firewalld.service
            systemctl disable firewalld.service
            
            #install pip and ansible
            yum install epel-release -y
            yum update
            yum install  python36 python36-pip git jq -y
            python3.6 -m pip install --upgrade pip
            python3.6 -m pip install virtualenv
            virtualenv /usr/local/bin/ansible
            source /usr/local/bin/ansible/bin/activate
            python3.6 -m pip install ansible==2.7.8
            python3.6 -m pip install hvac 
            python3.6 -m pip install ansible_merge_vars
            
            # convert labels to env vars
            gcloud compute instances list --filter="name:$(hostname)" --format 'value(labels)' | tr ';' '\n' | while read var ; do key="${var%=*}"; value="${var##*=}" ; key=$(echo $key | tr '[a-z]' '[A-Z]') ; echo "export $key=\"$value\"" ; done  > /etc/bashrc-labels
            
            # gcloud compute instances list --filter="name:$(hostname)" --format=json | jq .[].labels | tr -d '"|,|{|}|:' | while read key value ; do if [ ! -z "${key}" ] ; then  key=$(echo $key | tr '[a-z]' '[A-Z]') ; echo "export $key=\"$value\"" ; fi ; done > /etc/bashrc-labels
            
            echo "test -f /etc/bashrc-labels && source /etc/bashrc-labels" >> /etc/bashrc
            source /etc/bashrc-labels
            
            #env vars and paths
            echo "source /usr/local/bin/ansible/bin/activate " >> /root/.bashrc
            echo "export PATH=/usr/local/bin:$PATH" >> /root/.bashrc
            # echo "export GPROJECT=${gproject_ansible}"  >> /root/.bashrc
            # echo "export ANSIBLE_BRANCH=${ansible_branch}"  >> /root/.bashrc
            source /root/.bashrc
            
            #needed for checkout otherwise ssh cannot git clone or checkout
            mkdir ~/.ssh
            ssh-keyscan -H github.com >> ~/.ssh/known_hosts
            
            # Fetch all the common setup scripts from GCE metadata
            #curl -sH 'Metadata-Flavor: Google' http://metadata/computeMetadata/v1/project/attributes/ansible-key > /root/.ssh/id_rsa
            #chmod 0600 /root/.ssh/id_rsa
            
            #find newly added disks without rebooting ie:scratch disks
            /usr/bin/rescan-scsi-bus.sh
            
            #one time anisble run
            ansible-pull provisioner.yml -C ${ANSIBLE_BRANCH} -d /var/lib/ansible/local -U https://github.com/broadinstitute/dsp-ansible-configs.git -i hosts >> /root/ansible-provisioner-firstrun.log 2>&1
            
            # sh /root/ansible-setup.sh 2>&1 | tee /root/ansible-setup.log
            
            touch /etc/sysconfig/gce-metadata-run
            chmod 0644 /etc/sysconfig/gce-metadata-run
        EOT
      + min_cpu_platform          = (known after apply)
      + name                      = "singlecell-01"
      + project                   = "broad-singlecellportal-gmalkov"
      + self_link                 = (known after apply)
      + tags                      = [
          + "gce-lb-instance-group-member",
          + "http-server",
          + "https-server",
          + "mongodb",
          + "singlecell",
          + "singlecell-gmalkov",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-central1-a"

      + attached_disk {
          + device_name                = "docker"
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = "singlecell-01-docker-disk"
        }
      + attached_disk {
          + device_name                = "singlecell-mongo-data-disk"
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = "singlecell-01-data-disk"
        }

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "centos-7"
              + labels = (known after apply)
              + size   = 50
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "singlecell"
          + network_ip         = (known after apply)
          + subnetwork         = "singlecell"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute.readonly",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring.write",
              + "https://www.googleapis.com/auth/userinfo.email",
            ]
        }
    }

  # module.single-cell-portal.module.mongodb.module.instances.google_compute_instance_group.instance-group-unmanaged[0] will be created
+ resource "google_compute_instance_group" "instance-group-unmanaged" {
      + description = "singlecell Instance Group - Unmanaged"
      + id          = (known after apply)
      + instances   = (known after apply)
      + name        = "singlecell-instance-group-unmanaged"
      + network     = "singlecell"
      + project     = "broad-singlecellportal-gmalkov"
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "us-central1-a"

      + named_port {
          + name = "http"
          + port = 80
        }
      + named_port {
          + name = "https"
          + port = 443
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p gmalkov`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.102.213.175/lock?id=DataBiosphere%252Fsingle_cell_portal_terraform%252Fscp-deployment%252Fgmalkov)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p gmalkov`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
